puts "Назвіть сторону а трикутника "
a = gets.to_i
puts "Назвіть сторону b трикутника "
b = gets.to_i
puts "Назвіть сторону с трикутника"
c = gets.to_i
if (a**2+b**2) == c**2
  puts "прямокутний трикутник"
  if (a == b) || (a == c) || (b == c)
    puts "рівнобедренний"
  end
end
if (a == b) && (b == c)
  puts "Трикутник рівносторонній"
end







# if a**2 > b**2 && a**2 > c**2
#   puts "a гіпотенуза"
# elsif a**2 == b**2 || a**2 == c**2
#   puts "рівнобедренний трикутник"
# else
#   puts "Трикутник рівносторонній "
# end
